In [1]:
print("hello, world")

hello, world

In [2]:
print()

In [13]:
import pandas as pd
import numpy as np

In [21]:
np.arange(1,10, 0.1)

array([1. , 1.1, 1.2, 1.3, 1.4, 1.5, 1.6, 1.7, 1.8, 1.9, 2. , 2.1, 2.2,
       2.3, 2.4, 2.5, 2.6, 2.7, 2.8, 2.9, 3. , 3.1, 3.2, 3.3, 3.4, 3.5,
       3.6, 3.7, 3.8, 3.9, 4. , 4.1, 4.2, 4.3, 4.4, 4.5, 4.6, 4.7, 4.8,
       4.9, 5. , 5.1, 5.2, 5.3, 5.4, 5.5, 5.6, 5.7, 5.8, 5.9, 6. , 6.1,
       6.2, 6.3, 6.4, 6.5, 6.6, 6.7, 6.8, 6.9, 7. , 7.1, 7.2, 7.3, 7.4,
       7.5, 7.6, 7.7, 7.8, 7.9, 8. , 8.1, 8.2, 8.3, 8.4, 8.5, 8.6, 8.7,
       8.8, 8.9, 9. , 9.1, 9.2, 9.3, 9.4, 9.5, 9.6, 9.7, 9.8, 9.9])

In [22]:
arr = np.arange(1,10,1)
arr

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [26]:
data = np.array([
[40.003834,   116.321462,  211, 39745.175405,      "2008-10-24",      "04:12:35"],
[40.003783,   116.321431,  201, 39745.175463,      "2008-10-24",      "04:12:40"],
[40.003690,   116.321429,  203, 39745.175521,      "2008-10-24",      "04:12:45"],
[40.003589,   116.321427,  194, 39745.175579,      "2008-10-24",      "04:12:50"],
[40.003522,   116.321412,  190, 39745.175637,      "2008-10-24",      "04:12:55"],
[40.003509,   116.321484,  188, 39745.175694,      "2008-10-24",      "04:13:00"]]
)
print(data)

[['40.003834' '116.321462' '211' '39745.175405' '2008-10-24' '04:12:35']
 ['40.003783' '116.321431' '201' '39745.175463' '2008-10-24' '04:12:40']
 ['40.00369' '116.321429' '203' '39745.175521' '2008-10-24' '04:12:45']
 ['40.003589' '116.321427' '194' '39745.175579' '2008-10-24' '04:12:50']
 ['40.003522' '116.321412' '190' '39745.175637' '2008-10-24' '04:12:55']
 ['40.003509' '116.321484' '188' '39745.175694' '2008-10-24' '04:13:00']]

In [28]:
df = pd.DataFrame(data , columns=["lat","lng","alt","days","date","time"])

In [29]:
df

         lat         lng  alt          days        date      time
0  40.003834  116.321462  211  39745.175405  2008-10-24  04:12:35
1  40.003783  116.321431  201  39745.175463  2008-10-24  04:12:40
2   40.00369  116.321429  203  39745.175521  2008-10-24  04:12:45
3  40.003589  116.321427  194  39745.175579  2008-10-24  04:12:50
4  40.003522  116.321412  190  39745.175637  2008-10-24  04:12:55
5  40.003509  116.321484  188  39745.175694  2008-10-24  04:13:00

In [34]:
df.loc[df["alt"] > "200"]

         lat         lng  alt          days        date      time
0  40.003834  116.321462  211  39745.175405  2008-10-24  04:12:35
1  40.003783  116.321431  201  39745.175463  2008-10-24  04:12:40
2   40.00369  116.321429  203  39745.175521  2008-10-24  04:12:45

In [40]:
drinks = pd.read_csv("http://bit.ly/drinksbycountry")

In [41]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa